
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 29 to add, 2 to change, 35 to destroy.</code></pre>

* Create
  * module.darts_migration_key_vault[0].azurerm_key_vault.kv
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.product_team_access_policy
  * module.darts_migration_key_vault[0].azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_redis[0].azurerm_private_endpoint.this[0]
  * module.darts_redis[0].azurerm_redis_cache.redis
  * module.darts_redis[0].azurerm_resource_group.cache-resourcegroup[0]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-stg-dartsmig-01&#34;]
  * module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs[&#34;psql-stg-dartsmig-01&#34;]
  * module.postgresql_flexible[0].random_password.password
  * module.sa-migration[0].azapi_update_resource.defender_settings
  * module.sa-migration[0].azurerm_private_endpoint.this[0]
  * module.sa-migration[0].azurerm_storage_account.storage_account
  * module.sa-migration[0].azurerm_storage_container.container[&#34;darts-migration&#34;]
  * module.sa-migration[0].random_string.storage_account_random_string
  * module.sa-migration[0].time_rotating.rotate
  * module.sa-migration[0].time_static.pim_expiry
  * module.sa-migration[0].time_static.pim_start
* Update
  * azurerm_key_vault_secret.redis_connection_string[0]
  * module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_role_assignment.vm-admin[0]
  * azurerm_role_assignment.vm-admin[1]
  * azurerm_role_assignment.vm-admin[2]
  * azurerm_role_assignment.vm-admin[3]
  * azurerm_role_assignment.vm-admin[4]
  * azurerm_role_assignment.vm-admin[5]
  * module.darts_migration_key_vault.azurerm_key_vault.kv
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_redis.azurerm_private_endpoint.this[0]
  * module.darts_redis.azurerm_redis_cache.redis
  * module.darts_redis.azurerm_resource_group.cache-resourcegroup[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-stg-dartsmig-01&#34;]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;psql-stg-dartsmig-01&#34;]
  * module.postgresql_flexible.random_password.password
  * module.sa-migration.azapi_update_resource.defender_settings
  * module.sa-migration.azurerm_private_endpoint.this[0]
  * module.sa-migration.azurerm_storage_account.storage_account
  * module.sa-migration.azurerm_storage_container.container[&#34;darts-migration&#34;]
  * module.sa-migration.random_string.storage_account_random_string
  * module.sa-migration.time_rotating.rotate
  * module.sa-migration.time_static.pim_expiry
  * module.sa-migration.time_static.pim_start
* Replace
  * azurerm_key_vault_secret.POSTGRES_DATABASE[0]
  * azurerm_key_vault_secret.POSTGRES_HOST[0]
  * azurerm_key_vault_secret.POSTGRES_PASS[0]
  * azurerm_key_vault_secret.POSTGRES_PORT[0]
  * azurerm_key_vault_secret.POSTGRES_USER[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_DATABASE[0] must be replaced
  # (moved from azurerm_key_vault_secret.POSTGRES_DATABASE)
-/+ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      ~ id                      = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-DATABASE/0ac8af1e272b4d5ab3187130d351d3b0" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg" # forces replacement -> (known after apply)
        name                    = "POSTGRES-DATABASE"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-DATABASE/versions/0ac8af1e272b4d5ab3187130d351d3b0" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-DATABASE" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "0ac8af1e272b4d5ab3187130d351d3b0" -> (known after apply)
      ~ versionless_id          = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-DATABASE" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST[0] must be replaced
  # (moved from azurerm_key_vault_secret.POSTGRES_HOST)
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      ~ id                      = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-HOST/55074b2fb123472a9437a07392f0f43a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg" # forces replacement -> (known after apply)
        name                    = "POSTGRES-HOST"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-HOST/versions/55074b2fb123472a9437a07392f0f43a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-HOST" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "55074b2fb123472a9437a07392f0f43a" -> (known after apply)
      ~ versionless_id          = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-HOST" -> (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PASS[0] must be replaced
  # (moved from azurerm_key_vault_secret.POSTGRES_PASS)
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      ~ id                      = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-PASS/76adbb9824f94565bbaa369a14c0c9b4" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg" # forces replacement -> (known after apply)
        name                    = "POSTGRES-PASS"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-PASS/versions/76adbb9824f94565bbaa369a14c0c9b4" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-PASS" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "76adbb9824f94565bbaa369a14c0c9b4" -> (known after apply)
      ~ versionless_id          = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-PASS" -> (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT[0] must be replaced
  # (moved from azurerm_key_vault_secret.POSTGRES_PORT)
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      ~ id                      = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-PORT/475b20720257444aa044952d6f2b0634" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg" # forces replacement -> (known after apply)
        name                    = "POSTGRES-PORT"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-PORT/versions/475b20720257444aa044952d6f2b0634" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-PORT" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "475b20720257444aa044952d6f2b0634" -> (known after apply)
      ~ versionless_id          = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-PORT" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_USER[0] must be replaced
  # (moved from azurerm_key_vault_secret.POSTGRES_USER)
-/+ resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      ~ id                      = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-USER/0a28faa3ba514b638add7d5c8b3e70c1" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg" # forces replacement -> (known after apply)
        name                    = "POSTGRES-USER"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-USER/versions/0a28faa3ba514b638add7d5c8b3e70c1" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/secrets/POSTGRES-USER" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "0a28faa3ba514b638add7d5c8b3e70c1" -> (known after apply)
      ~ versionless_id          = "https://darts-migration-stg.vault.azure.net/secrets/POSTGRES-USER" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.os_profile_password has moved to azurerm_key_vault_secret.os_profile_password[0]
    resource "azurerm_key_vault_secret" "os_profile_password" {
        id                      = "https://darts-stg.vault.azure.net/secrets/os-profile-password/5d0f108cdbcf43b2bac0bc4c6cb33acb"
        name                    = "os-profile-password"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis_connection_string[0] will be updated in-place
  # (moved from azurerm_key_vault_secret.redis_connection_string)
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
        id                      = "https://darts-stg.vault.azure.net/secrets/redis-connection-string/e23d22230c5a49eab53940f4ed897144"
        name                    = "redis-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_linux_virtual_machine.migration has moved to azurerm_linux_virtual_machine.migration[0]
    resource "azurerm_linux_virtual_machine" "migration" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
        name                            = "migration-vm"
        tags                            = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_managed_disk.migration_data has moved to azurerm_managed_disk.migration_data[0]
    resource "azurerm_managed_disk" "migration_data" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/disks/migration-datadisk"
        name                          = "migration-datadisk"
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_managed_disk.migration_os has moved to azurerm_managed_disk.migration_os[0]
    resource "azurerm_managed_disk" "migration_os" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/disks/migration-osdisk"
        name                          = "migration-osdisk"
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_network_interface.assessment has moved to azurerm_network_interface.assessment[0]
    resource "azurerm_network_interface" "assessment" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/networkInterfaces/assessment-nic"
        name                          = "assessment-nic"
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.migration has moved to azurerm_network_interface.migration[0]
    resource "azurerm_network_interface" "migration" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/networkInterfaces/migration-nic"
        name                          = "migration-nic"
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.darts_migration_resource_group has moved to azurerm_resource_group.darts_migration_resource_group[0]
    resource "azurerm_resource_group" "darts_migration_resource_group" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg"
        name     = "darts-migration-stg-rg"
        tags     = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.vm-admin[0] will be destroyed
  # (because resource does not use count)
  - resource "azurerm_role_assignment" "vm-admin" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm/providers/Microsoft.Authorization/roleAssignments/90ae6568-bae1-f499-446c-b57ff5ee4c92" -> null
      - name                 = "90ae6568-bae1-f499-446c-b57ff5ee4c92" -> null
      - principal_id         = "675f1c23-3e46-4cf8-867b-747eb60fe89d" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> null
      - role_definition_name = "Virtual Machine Administrator Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm" -> null
    }

  # azurerm_role_assignment.vm-admin[1] will be destroyed
  # (because resource does not use count)
  - resource "azurerm_role_assignment" "vm-admin" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm/providers/Microsoft.Authorization/roleAssignments/a280bab0-2377-a64b-a245-e891b9fa5e65" -> null
      - name                 = "a280bab0-2377-a64b-a245-e891b9fa5e65" -> null
      - principal_id         = "d8b336b1-91fb-4fa6-bbe2-1f197c0d52c8" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> null
      - role_definition_name = "Virtual Machine Administrator Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm" -> null
    }

  # azurerm_role_assignment.vm-admin[2] will be destroyed
  # (because resource does not use count)
  - resource "azurerm_role_assignment" "vm-admin" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm/providers/Microsoft.Authorization/roleAssignments/86a4cb21-c5ee-ca67-d27d-131b8860c4d8" -> null
      - name                 = "86a4cb21-c5ee-ca67-d27d-131b8860c4d8" -> null
      - principal_id         = "14f9cf0e-8327-4f12-9d2c-f7e7eb05629d" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> null
      - role_definition_name = "Virtual Machine Administrator Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm" -> null
    }

  # azurerm_role_assignment.vm-admin[3] will be destroyed
  # (because resource does not use count)
  - resource "azurerm_role_assignment" "vm-admin" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm/providers/Microsoft.Authorization/roleAssignments/94225119-eadb-bc5e-7321-0675b20ebd06" -> null
      - name                 = "94225119-eadb-bc5e-7321-0675b20ebd06" -> null
      - principal_id         = "50132661-6997-484e-b0fd-5ec1052afabb" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> null
      - role_definition_name = "Virtual Machine Administrator Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm" -> null
    }

  # azurerm_role_assignment.vm-admin[4] will be destroyed
  # (because resource does not use count)
  - resource "azurerm_role_assignment" "vm-admin" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm/providers/Microsoft.Authorization/roleAssignments/c1aee21b-aa63-83b5-2898-e932d0c9b144" -> null
      - name                 = "c1aee21b-aa63-83b5-2898-e932d0c9b144" -> null
      - principal_id         = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> null
      - role_definition_name = "Virtual Machine Administrator Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm" -> null
    }

  # azurerm_role_assignment.vm-admin[5] will be destroyed
  # (because resource does not use count)
  - resource "azurerm_role_assignment" "vm-admin" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm/providers/Microsoft.Authorization/roleAssignments/cb886f62-9613-6377-abee-e11f84a61f41" -> null
      - name                 = "cb886f62-9613-6377-abee-e11f84a61f41" -> null
      - principal_id         = "cd395cb0-35d7-454b-8c99-26422f78901e" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> null
      - role_definition_name = "Virtual Machine Administrator Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm" -> null
    }

  # azurer

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

teDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "sastgdartsmig01.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.24.239.134",
                        ]
                      - name         = "sastgdartsmig01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "darts-migration-stg-rg" -> null
      - subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet" -> null
      - tags                     = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/privateEndpoints/sastgdartsmig01/privateDnsZoneGroups/endpoint-dnszonegroup" -> null
          - name                 = "endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "sastgdartsmig01" -> null
          - private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01" -> null
          - private_ip_address             = "10.24.239.134" -> null
          - subresource_names              = [
              - "blob",
            ] -> null
        }
    }

  # module.sa-migration.azurerm_storage_account.storage_account will be destroyed
  # (because module.sa-migration is not in configuration)
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "BlockBlobStorage" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Premium" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "sastgdartsmig01" -> null
      - nfsv3_enabled                     = true -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://sastgdartsmig01.blob.core.windows.net/" -> null
      - primary_blob_host                 = "sastgdartsmig01.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://sastgdartsmig01.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "sastgdartsmig01.dfs.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_web_endpoint              = "https://sastgdartsmig01.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "sastgdartsmig01.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "darts-migration-stg-rg" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null

          - container_delete_retention_policy {
              - days = 7 -> null
            }

          - delete_retention_policy {
              - days = 365 -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # module.sa-migration.azurerm_storage_container.container["darts-migration"] will be destroyed
  # (because module.sa-migration is not in configuration)
  - resource "azurerm_storage_container" "container" {
      - container_access_type   = "private" -> null
      - has_immutability_policy = false -> null
      - has_legal_hold          = false -> null
      - id                      = "https://sastgdartsmig01.blob.core.windows.net/darts-migration" -> null
      - metadata                = {} -> null
      - name                    = "darts-migration" -> null
      - resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01/blobServices/default/containers/darts-migration" -> null
      - storage_account_name    = "sastgdartsmig01" -> null
    }

  # module.sa-migration.random_string.storage_account_random_string will be destroyed
  # (because module.sa-migration is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "vraso7utmxpwiq11zxknlc85" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "vraso7utmxpwiq11zxknlc85" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.sa-migration.time_rotating.rotate will be destroyed
  # (because module.sa-migration is not in configuration)
  - resource "time_rotating" "rotate" {
      - day              = 11 -> null
      - hour             = 10 -> null
      - id               = "2023-11-17T10:38:18Z" -> null
      - minute           = 38 -> null
      - month            = 11 -> null
      - rfc3339          = "2023-11-17T10:38:18Z" -> null
      - rotation_days    = 360 -> null
      - rotation_rfc3339 = "2024-11-11T10:38:18Z" -> null
      - second           = 18 -> null
      - unix             = 1731321498 -> null
      - year             = 2024 -> null
    }

  # module.sa-migration.time_static.pim_expiry will be destroyed
  # (because module.sa-migration is not in configuration)
  - resource "time_static" "pim_expiry" {
      - day     = 11 -> null
      - hour    = 10 -> null
      - id      = "2024-11-11T10:38:18Z" -> null
      - minute  = 38 -> null
      - month   = 11 -> null
      - rfc3339 = "2024-11-11T10:38:18Z" -> null
      - second  = 18 -> null
      - unix    = 1731321498 -> null
      - year    = 2024 -> null
    }

  # module.sa-migration.time_static.pim_start will be destroyed
  # (because module.sa-migration is not in configuration)
  - resource "time_static" "pim_start" {
      - day     = 17 -> null
      - hour    = 10 -> null
      - id      = "2023-11-17T10:38:18Z" -> null
      - minute  = 38 -> null
      - month   = 11 -> null
      - rfc3339 = "2023-11-17T10:38:18Z" -> null
      - second  = 18 -> null
      - unix    = 1700217498 -> null
      - year    = 2023 -> null
    }

  # module.sa-migration[0].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa-migration[0].azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "sastgdartsmig01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "darts-migration-stg-rg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet"
      + tags                     = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "sastgdartsmig01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.sa-migration[0].azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "BlockBlobStorage"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Premium"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = true
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "sastgdartsmig01"
      + nfsv3_enabled                     = true
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "darts-migration-stg-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 365
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.sa-migration[0].azurerm_storage_container.container["darts-migration"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "darts-migration"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "sastgdartsmig01"
    }

  # module.sa-migration[0].random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.sa-migration[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa-migration[0].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sa-migration[0].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 29 to add, 2 to change, 35 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":118,"Program":"tfcmt","SHA1":"","Vars":{}} -->